# GetDBServerId Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
IExternalResourceUIServer..::..GetDBServerId Method
IExternalResourceUIServer Interface See Also
---
Implement this method to return the id of the server which is associated with this UI server.
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
Guid GetDBServerId()
```

Visual Basic
---
```text
Function GetDBServerId As Guid
```

Visual C++
---
```text
Guid GetDBServerId()
```

# ### Return Value
The id of the associated DB server.
# Remarks
If there's no DB server associated with this UI server, an empty GUID value will be returned.
# See Also
IExternalResourceUIServer Interface
Autodesk.Revit.UI Namespace